Revit 2027 API
IViewSheetSet.IsAutomatic Property
 Automatic order or manual order.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool IsAutomatic { get; set; }
Property IsAutomatic As Boolean
	Get
	Set
property bool IsAutomatic {
	bool get ();
	void set (bool value);
}
abstract IsAutomatic : bool with get, set
Property Value
Boolean
See Also
Reference
IViewSheetSet Interface
Autodesk.Revit.DB Namespace